{
  "projects": [
    {
      "title": "EquiSports",
      "id": 1,
      "description": "This project showcases a responsive sports equipment website with animations and smooth transitions. EquiSports is a dynamic e-commerce platform built with React, Node.js, and MongoDB. It includes secure login and payment functionalities.",
      "images": [
        "https://i.ibb.co/hFdxZ4j/assignment-9-1.png",
        "https://i.ibb.co/8sRFFB8/assignment-9-2.png",
        "https://i.ibb.co/bsY2p4G/assignment-9-3.png"
      ],
      "liveLink": "https://gregarious-crostata-c9ae8a.netlify.app/",
      "github": "https://github.com/programming-hero-web-course2/b10-a10-client-side-Ahad-Miah",
      "techStack": ["React", "Node.js", "MongoDB", "Tailwind CSS"],
      "details": "EquiSports allows users to purchase sports equipment with a user-friendly interface. Features include advanced filtering, secure payment integration, and a responsive design.",
      "challenges": "Implementing secure payment processing and optimizing database queries for real-time updates.",
      "shortcomings": "Currently lacks advanced analytics and a wishlist feature.",
      "futureImprovements": "Plan to add user analytics and implement a loyalty program for frequent buyers."
    },
    {
      "title": "TutorHub",
      "id": 2,
      "description": "TutorHub is a platform for connecting tutors and students. It provides features like secure login, live sessions, and payment gateways for a seamless experience.",
      "images": [
        "https://i.ibb.co/52fRxF2/assignment-11-1.png",
        "https://i.ibb.co/k89bvdY/assignement-11-2.png",
        "https://i.ibb.co/sJ4HPR6/assignment-11-3.png"
      ],
      "liveLink": "https://startling-brigadeiros-0c7e32.netlify.app/",
      "github": "https://github.com/programming-hero-web-course2/b10a11-client-side-Ahad-Miah",
      "techStack": ["React", "Node.js", "MongoDB", "Bootstrap"],
      "details": "TutorHub simplifies the process of finding and booking tutors. Features include a responsive dashboard, advanced search, and real-time notifications.",
      "challenges": "Ensuring scalability for handling a growing number of tutors and students, and implementing secure session management.",
      "shortcomings": "Currently missing feedback and rating systems for tutors.",
      "futureImprovements": "Planning to add user reviews, better session analytics, and improved mobile compatibility."
    },
    {
      "title": "ChatMate",
      "id": 3,
      "description": "ChatMate is a real-time messaging application built using WebSockets for seamless communication. It provides instant messaging and group chat functionalities.",
      "images": [
        "https://i.ibb.co/FJftsRP/assignment-10-1.png",
        "https://i.ibb.co/HGrN6Y2/assignment-10-2.png",
        "https://i.ibb.co/tXS5xDw/assignment-10-3.png"
      ],
      "liveLink": "https://bejewelled-swan-8d3859.netlify.app/",
      "github": "https://github.com/programming-hero-web-course1/b10-a9-authentication-Ahad-Miah",
      "techStack": ["React", "Node.js", "WebSocket", "Firebase"],
      "details": "ChatMate enables real-time messaging with a focus on reliability and performance. It supports private chats, group chats, and multimedia sharing.",
      "challenges": "Optimizing WebSocket connections and ensuring message delivery under poor network conditions.",
      "shortcomings": "Limited multimedia support and lack of message history synchronization across devices.",
      "futureImprovements": "Adding multimedia previews, synchronized message history, and support for video calling."
    }
  ]
}
