{
  "projects": [
    {
      "title": "KeyNest",
      "id": 1,
      "description": "KeyNest is a full-stack real estate platform built with the MERN stack. It allows users to browse, wishlist, and purchase verified properties while enabling agents to manage their listings and offers.",
      "images": [
        "https://i.ibb.co.com/hx26gYfn/keynest.png",
        "https://i.ibb.co.com/YTWXHwmp/keynest-admin.png",
        "https://i.ibb.co.com/tTBxXkrb/keynest-agent.png",
        "https://i.ibb.co.com/xSYtqFd4/keynest-user.png"
      ],
      "liveLink": "https://tiny-cat-28deae.netlify.app/",
      "github": "https://github.com/Ahad-Miah/KeyNest",
      "techStack": ["React", "Node.js", "Express.js", "MongoDB", "TailwindCSS", "Firebase", "JWT", "Stripe"],
      "details": "KeyNest provides an intuitive and secure platform for real estate transactions. Users can explore properties, wishlist their favorites, and make offers, while agents can list properties, manage offers, and track sales. Admins have full control over property verification and user management.",
      "challenges": "Implementing a secure authentication system with JWT, ensuring smooth payment integration with Stripe, and optimizing database queries for scalability.",
      "shortcomings": "Limited property search filters and lack of real-time chat between users and agents.",
      "futureImprovements": "Adding advanced search and filtering options, integrating a chat system, and improving the dashboard UI for a better user experience."
    },    
    {
      "title": "EquiSports",
      "id": 2,
      "description": "This project showcases a responsive sports equipment website with animations and smooth transitions. EquiSports is a dynamic e-commerce platform built with React, Node.js, and MongoDB. It includes secure login and payment functionalities.",
      "images": [
        "https://i.ibb.co/hFdxZ4j/assignment-9-1.png",
        "https://i.ibb.co/8sRFFB8/assignment-9-2.png",
        "https://i.ibb.co/bsY2p4G/assignment-9-3.png"
      ],
      "liveLink": "https://gregarious-crostata-c9ae8a.netlify.app/",
      "github": "https://github.com/Ahad-Miah/EquiSports",
      "techStack": ["React", "Node.js", "MongoDB", "Tailwind CSS","Firebase"],
      "details": "EquiSports allows users to purchase sports equipment with a user-friendly interface. Features include advanced filtering, secure payment integration, and a responsive design.",
      "challenges": "Implementing secure payment processing and optimizing database queries for real-time updates.",
      "shortcomings": "Currently lacks advanced analytics and a wishlist feature.",
      "futureImprovements": "Plan to add user analytics and implement a loyalty program for frequent buyers."
    },
    {
      "title": "TutorHub",
      "id": 3,
      "description": "TutorHub is a platform for connecting tutors and students. It provides features like secure login, live sessions, and payment gateways for a seamless experience.",
      "images": [
        "https://i.ibb.co/52fRxF2/assignment-11-1.png",
        "https://i.ibb.co/k89bvdY/assignement-11-2.png",
        "https://i.ibb.co/sJ4HPR6/assignment-11-3.png"
      ],
      "liveLink": "https://startling-brigadeiros-0c7e32.netlify.app/",
      "github": "https://github.com/Ahad-Miah/TutorHub",
      "techStack": ["React", "Node.js", "MongoDB", "Bootstrap"],
      "details": "TutorHub simplifies the process of finding and booking tutors. Features include a responsive dashboard, advanced search, and real-time notifications.",
      "challenges": "Ensuring scalability for handling a growing number of tutors and students, and implementing secure session management.",
      "shortcomings": "Currently missing feedback and rating systems for tutors.",
      "futureImprovements": "Planning to add user reviews, better session analytics, and improved mobile compatibility."
    }
  
  ]
}
